# 필요 라이브러리
- import numpy np
- import padas as pd
- pandas는 numpy의 확장 중요하다.
- 데이터 처리하기 이전의 데이터를 탐색하기 좋은 것이 pandas
- import matplotlib.pyplot as plt

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## Pandas 자료 구조
- series 넘파이에서 제공하는 1차원 배열과 비슷
- 'series라는 클래스'는 (1)인덱스와 (2)값(value)를 가지고 있다.
pd.Series() <- 클래스라서 맨앞 글자가 대문자.
- dataframe(R의 dataframe이 넘어왔다고 생가각하면 된다.)

In [3]:
obj = pd.Series([1, 2, 3, 4, 5])
x = np.array([1, 2, 3, 4, 5]) #넘파이 배열을 만들겠다.

In [4]:
x

array([1, 2, 3, 4, 5])

In [5]:
obj #인덱스 객체로 결과값이 나온다.
#별도로 인덱스 값을 주지 않으면 정수 인덱스가 온다.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# 시리즈 생성
s = pd.Series([9904312, 3448737, 2890451, 2466052],
             index = ['서울', '대전', '대구', '부산'])
s #위와 달리 인덱스 값을 부여

서울    9904312
대전    3448737
대구    2890451
부산    2466052
dtype: int64

In [8]:
s.index

Index(['서울', '대전', '대구', '부산'], dtype='object')

In [9]:
s.values
#결괏값이 배열(array)로 나온다.

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [10]:
s

서울    9904312
대전    3448737
대구    2890451
부산    2466052
dtype: int64

In [13]:
#각 값(value)에 이름을 부여
s.name = '인구'
s.index.name = '도시' #인덱스에 부여
s

도시
서울    9904312
대전    3448737
대구    2890451
부산    2466052
Name: 인구, dtype: int64

In [14]:
s / 1000000 #인덱스에는 영향이 없다. 값에 접근해서 계산

도시
서울    9.904312
대전    3.448737
대구    2.890451
부산    2.466052
Name: 인구, dtype: float64

In [15]:
#indexing : 인덱스로 이름이 있는 것:라벨 을 통해 접근할 수 있다.
s[1]

3448737

In [16]:
s['대전']

3448737

In [17]:
s[[0, 3, 1]] 
#R의 컴바인 처럼 파이썬에서는 리스트로 접근해서 인덱싱한다.

도시
서울    9904312
부산    2466052
대전    3448737
Name: 인구, dtype: int64

In [18]:
s[['부산', '서울', '대전']]

도시
부산    2466052
서울    9904312
대전    3448737
Name: 인구, dtype: int64

In [19]:
# 대괄호 조건식
## 인구가 250만 초과,(이고and) 500만 미만인 경우 추출
s[(s > 2500000) & (s < 5000000)] #&만 된다. and, , 안됨

도시
대전    3448737
대구    2890451
Name: 인구, dtype: int64

In [22]:
#시리즈는 일차원 배열
s[1:3]

도시
대전    3448737
대구    2890451
Name: 인구, dtype: int64

In [23]:
s

도시
서울    9904312
대전    3448737
대구    2890451
부산    2466052
Name: 인구, dtype: int64

In [24]:
s['대구':'부산'] #문자 인덱스는 글 그대로 추출 된다.

도시
대구    2890451
부산    2466052
Name: 인구, dtype: int64

In [25]:
s0 = pd.Series(range(3), index = ['a', 'b', 'c'])
s0

a    0
b    1
c    2
dtype: int64

In [26]:
s0.a

0

In [27]:
s0[0]

0

In [28]:
s0['a']

0

In [29]:
s0.a #다이렉트 연산자를 통해서도 접근 할 수 있다.

0

In [30]:
'서울' in s #서울이라는 값이s라는 시리즈에 포함되어 있습니까?

True

In [31]:
'인천' in s #인천이라는 라벨이 s에 포함되어 있냐

False

In [ ]:
# 사전.keys()
# 사전.values()
# 사전.items() : key,value를 튜플타입으로 세트로 들고와

In [33]:
for k, v in s.items():
    print("%s = %d" % (k, v))

서울 = 9904312
대전 = 3448737
대구 = 2890451
부산 = 2466052

In [34]:
s2 = pd.Series({'서울' : 963148, '부산':3393191,
                '인천':2632035, '대전':1490158})
s2

서울     963148
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [35]:
#딕셔너리를 순서를 가지고 있지 않다.
#여기서 순서를 바꾸고 싶다면 인덱스를 주어야 한다.
s2 = pd.Series({'서울' : 963148, '부산':3393191,
                '인천':2632035, '대전':1490158},
              index = ['부산', '대전', '인천', '서울'])

s2

부산    3393191
대전    1490158
인천    2632035
서울     963148
dtype: int64

In [38]:
#파이썬의 dict
sdata = {'Ohio':3500, 'Texas':71000, "Oregon":1600, 'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio       3500
Texas     71000
Oregon     1600
Utah       5000
dtype: int64

In [39]:
# 파이썬의 list
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio           3500.0
Oregon         1600.0
Texas         71000.0
dtype: float64

In [40]:
#isnull(), notnull()
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [41]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [42]:
obj3

Ohio       3500
Texas     71000
Oregon     1600
Utah       5000
dtype: int64

In [43]:
obj4

California        NaN
Ohio           3500.0
Oregon         1600.0
Texas         71000.0
dtype: float64

In [44]:
obj3 + obj4

California         NaN
Ohio            7000.0
Oregon          3200.0
Texas         142000.0
Utah               NaN
dtype: float64

## Data Frame
- 표 형태로 구현 된 자료 구조
- 2차원 행렬 + 인덱스(행(row)의 인덱스, 열(column)의 인덱스)
- dataframe()

In [45]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

columns = ['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율']
index = ['서울', '부산', '인천', '대구']

df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [46]:
df.head()

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [47]:
df.info()
#데이터 분석에서 가장 많이 쓰는 거 str()과 비슷

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 대구
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지역             4 non-null      object
 1   2015           4 non-null      int64
 2   2010           4 non-null      int64
 3   2005           4 non-null      int64
 4   2000           4 non-null      int64
 5   2010-2015 증가율  4 non-null      float64
dtypes: float64(1), int64(4), object(1)
memory usage: 224.0+ bytes

In [48]:
df.describe()

               2015          2010          2005          2000  2010-2015 증가율
count  4.000000e+00  4.000000e+00  4.000000e+00  4.000000e+00       4.000000
mean   4.677388e+06  4.522120e+06  4.562197e+06  4.612434e+06       0.039225
std    3.507776e+06  3.431328e+06  3.500545e+06  3.538749e+06       0.039809
min    2.466052e+06  2.431774e+06  2.456016e+06  2.466338e+06       0.014100
25%    2.784351e+06  2.581970e+06  2.502264e+06  2.472077e+06       0.015750
50%    3.169594e+06  3.012613e+06  3.015114e+06  3.064714e+06       0.022300
75%    5.062631e+06  4.952764e+06  5.075047e+06  5.205071e+06       0.045775
max    9.904312e+06  9.631482e+06  9.762546e+06  9.853972e+06       0.098200

In [49]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [50]:
df.columns
#오브젝트는 문자를 뜻함

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [51]:
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [53]:
df.columns.name ='특성'
df.index.name = '도시'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [54]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [57]:
df = df.drop('2010-2015 증가율', axis = 1)

In [58]:
df

특성   지역     2015     2010     2005     2000
도시
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437
인천  수도권  2890451  2632035  2517680  2466338
대구  경상권  2466052  2431774  2456016  2473990

In [61]:
#2005-2010년 증가율이라는 열(column) 추가 하기(소수점 둘째자리 까지)
#파생변수 기존의 데이터를 이용
df['2005-2010 증가율'] = ((df['2010'] - df['2005'])/ df['2005'] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [60]:
#열을 삭제하는 함수 #바로 원본에서 삭제 가능
del df['2005-2010 증가율']
df

특성   지역     2015     2010     2005     2000
도시
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437
인천  수도권  2890451  2632035  2517680  2466338
대구  경상권  2466052  2431774  2456016  2473990

In [62]:
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [63]:
df['지역'] #반환되는 값은 Series

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [64]:
df[['2010','2015']] #2개이상 반환 될 때에는 dataframe형태

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [65]:
df[['지역']] #하나만 반환 될 때에도 대괄호를 한번 더 묶으면 dataframe을 사용

특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [66]:
#자료형을 확인하는 함수 type
type(df[['지역']])

pandas.core.frame.DataFrame

In [67]:
type(df['지역'])

pandas.core.series.Series

#### loc와 iloc를 이용한 인덱스 슬라이싱

In [69]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [71]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [73]:
#열 인덱스
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [74]:
#행 인덱스
frame.index

RangeIndex(start=0, stop=6, step=1)

In [70]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [75]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [76]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [80]:
#라벨링 되어 있는 것을 불러 올 때loc라는 것을 쓰자
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [77]:
frame2['three']

KeyError: 'three'

In [79]:
frame2[2]

KeyError: 2

In [81]:
frame2.iloc[2] #숫자 인덱스를 써서 행의 값을 들고 올 때

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [83]:
#일괄적으로 같은 값을 넣는 방법
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [84]:
#값을 서로 다르게 주는 것
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [85]:
# 데이터프레임 값을 담을 때는 반드시 그 크기가 같아야 한다.
# 그렇지 않으면 NaN(missing value, 결측값)이 생성된다.
val = pd.Series([-1.2, -1.5, -1.7],
               index = ['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [86]:
#데이터프레임은 여러개의 시리즈객체가 결합된 형태이다.
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [87]:
#파생변수 : 기존의 값을 이용해서 새로운 컬럼을 추가
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [88]:
#컬럼 인덱스를 가져 오는 방법
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [93]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3 #안쪽에 있는key값은 row의 인덱스

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [95]:
pd.DataFrame(pop, index = [2000, 2001, 2002])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [96]:
pd.DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN